Tekla Open API Reference for Tekla Structures 2025
PartMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.PartMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
AssemblyPosition
Returns the assembly position property element type.
Camber
Returns the camber property element type.
CenterToCenterDistance
Returns the center-to-center distance property element type.
Class
Returns the class property element type.
FaceDirection
Returns the face direction property element type.
Finish
Returns the finish property element type.
FittingsNsFs
Returns the fittings (NS/FS) property element type.
GageOfOutstandingLeg
Returns the gage of the outstanding leg property element type.
Length
Returns the length property element type.
Material
Returns the material property element type.
Name
Returns the name property element type.
PartPosition
Returns the part position property element type.
Profile
Returns the profile property element type.
RotationAngle
Returns the rotation angle property element type.
Size
Returns the size property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.PartMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace